MCP docs, better readme, and fixed links in docs (#610)
* MCP docs and better readme

* URL fixes in docs + Changelog + missing types export

* Updated jsdoc comments

* Fix to api report

* New badge added to mcp article
